argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
}

/* USER CODE BEGIN 4 */

UART_HandleTypeDef uart_console;

void com_init()
{
  BSP_COM_DeInit(COM1, &uart_console);
  BSP_COM_Init(COM1, &uart_console);
}

uint16_t cli_printf(const char* fmt, ...)
{
    va_list  args;
    uint16_t len = 0;

    va_start(args, fmt);
    len = cli_varg_printf(fmt, args);
    va_end(args);

    return len;
}

uint16_t cli_write(const char* src, uint16_t len)
{
    HAL_UART_Transmit(&huart1, (uint8_t*)src, len, 100);
}

uint16_t cli_varg_printf(const char* fmt, va_list args)
{
    uint16_t len = 0;
    if (NULL != fmt)
    {
        //len = (uint16_t) tfp_vsnprintf(&cli_fmt_buffer[0], CLI_FMT_BUFFER_LEN, fmt, args);
    }
    return cli_write(fmt, strlen(fmt));
    // return cli_write(&cli_fmt_buffer[0], len);
}

void StartLEDTask(void const * argument)
{
  //char* string = "Hello World";
  uint8_t led_state = 0;

  BSP_LED_Init(LED_GREEN);
  BSP_LED_Off(LED_GREEN);
  
  // com_init();
    
  /* Infinite loop */
  for(;;)
  {
    xQueueReceive(ledQueueHandle, &led_state, 0);

    if (led_state == 1)
    {
      BSP_LED_On(LED_GREEN);
    }
    else
    {
      BSP_LED_Off(LED_GREEN);
    }
    
    cli_printf("Hello %s \r\n", "world");
    
    // com_printf("Model::p2m_SetLEDState: %d\r\n", led_state);
    
    osDelay(20);
  }
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{

/* Graphic application */  
  GRAPHICS_MainTask();

  /* USER CODE BEGIN 5 */
    /* Infinite loop */
    for (;;)
    {
        osDelay(1);
    }
  /* USER CODE END 5 */ 
}

/* USER CODE BEGIN Header_StartButtonTask */
/**
* @brief Function implementing the buttonTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartButtonTask */
void StartButtonTask(void const * argument)
{
  /* USER CODE BEGIN StartButtonTask */
  uint32_t buttonState = 0;
  
  BSP_PB_Init(BUTTON_KEY, BUTTON_MODE_GPIO);
  
  /* Infinite loop */
  for(;;)
  {
    buttonState = BSP_PB_GetState(BUTTON_KEY);
    if (buttonState == 1)
    {
      xQueueSend(&buttonQueueHandle, (uint8_t*)&buttonState, 0);
    }
    osDelay(100);
  }
  /* USER CODE END StartButtonTask */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
       tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
